klemos06/EFM8LB1-Project/integratedremote.c
void waitms (unsigned int ms)
{
	unsigned int j;
	for(j=ms; j!=0; j--)
	{
		Timer3us(249);
		Timer3us(249);
		Timer3us(249);
		Timer3us(250);
	}
}




void TIMER0_Init(void)
{
	TMOD&=0b_1111_0000; // Set the bits of Timer/Counter 0 to zero
	TMOD|=0b_0000_0001; // Timer/Counter 0 used as a 16-bit timer
	TR0=0; // Stop Timer/Counter 0
}



// -------------------------IR Functions-------------------------------

// converts fourteen bit to eight bit 
int fourteen_to_eight(int val){
	return ((val*255.0)/65535.0);
}

// this fcn is always happening --> therefore the pca will keep triggering in the background (if it runs depends on ir_send's val) 
void PCA_ISR (void) interrupt INTERRUPT_PCA0
{
	unsigned int j;
	
	SFRPAGE=0x0;
	
	if (CCF0)
	{
		
		j=(PCA0CPH0*0x100+PCA0CPL0)+(SYSCLK/(2L*PCA_0_FREQ));
		PCA0CPL0=j%0x100; //Always write low byte first!
		PCA0CPH0=j/0x100;
		CCF0=0;

		if (ir_send == 1){
			PCA_OUT_0=!PCA_OUT_0; // if the IR send is 1 --> turn on the pin 
		}

		else {
			PCA_OUT_0 = 0; // if the IR send is 0 --> turn off the pin even if the interrupt is generated 
		}
	}
	CF=0;
}

// start sequence 
// sends 3 1s and 2 0s --> 11100 
int start_transmit (int start_bit){
	if (start_bit){
		int i;

		for (i = 0;i<3;i++){ 
			ir_send = 1;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}

		for (i=0;i<2; i++){
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			
		}
		
		return 0; 
	}
	else {
		return -1;
	}
}

int end_transmit (int end_bit){			// 10000
	if (end_bit){
		int i;

		for (i = 0;i<1;i++){ 
			ir_send = 1;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}

		for (i=0;i<4; i++){
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			
		}
		return 0; 
	}
	else {
		return -1;
	}
}

// parses 8 bits and sends IR accordingly
void transmit_byte(uint8_t input){

	int i; 
	for (i = 7; i >= 0; i--){
		if ((input >> i) & 1) {			// this shifts the first bit to the right and ands it with 1 --> if this is one, this means the bit is supposed to be a one  
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);				// 2240 us high
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);				// 4480 us low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			
		}
		else {				// if its a zero, then its sends zero sequence 
			ir_send = 1; 
			Timer3us(560);			// 2240 us high and low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}

	} 
}

void transmit_bit(uint8_t val_bit){
	if (val_bit & 1){
		 ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);				// 2240 us high
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);				// 4480 us low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}
	else {
		ir_send = 1; 
			Timer3us(560);			// 2240 us high and low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}
	}

void transmit_path(int path_flag){

int i;

switch(path_flag){

case 1: // path 1 --> o/p is 00
		for (i=0;i<2; i++){
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			
		}
		break;
case 2:		// path 2 --> o/p is 01
	for (i=0;i<1; i++){
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);		
		}
	for (i = 0;i<1;i++){ 
			ir_send = 1;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}
		break;
case 3: // path 3 --> o/p is 10
	for (i = 0;i<1;i++){ 
			ir_send = 1;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}
	for (i=0;i<1; i++){
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0;
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			
		}
		break; 
	}
}

void transmit_checksum(uint8_t x_in, uint8_t y_in){
	int i; 
	
	uint8_t math;
	math = (x_in+y_in)/2;
	
	for (i = 7; i >= 0; i--){
		if ((math >> i) & 1) {			// this shifts the first bit to the right and ands it with 1 --> if this is one, this means the bit is supposed to be a one  
			ir_send = 1; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);				// 2240 us high
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);				// 4480 us low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			}
		
		else {				// if its a zero, then its sends zero sequence 
			ir_send = 1; 
			Timer3us(560);			// 2240 us high and low 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			ir_send = 0; 
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
			Timer3us(560);
		}
	}

} 


// ----- State machine functions -----


void read_inputs(void) {

	ClearBuffer();
	
	// Read joystick position
    x_pos_sec = ADC_at_Pin(QFP32_MUX_P2_6);

	// Convert joystick position into binary direction
	if(x_pos_sec > 13730)
		real_x_sec = 1;
	else if (x_pos_sec < 9000)
		real_x_sec = -1;	
	else
		real_x_sec = 0;	   
	
	// If right button (green) increment to next screen
	if(butr && !prev_butr) { // Debounced button
		right_button_pressed = 1;
	}
	else
		right_button_pressed = 0;
	prev_butr = butr; // Set current equal to previous 
	
	// If left button (yellow) decrement to previous screen
	if(butl && !prev_butl) { // Debounced button
		left_button_pressed = 1;
	}	
	else
		left_button_pressed = 0;
	prev_butl = butl;   
	
	
	
	
	x_pos = ADC_at_Pin(QFP32_MUX_P2_3);
	y_pos = ADC_at_Pin(QFP32_MUX_P2_2);
	
	if(x_pos > 11730) {
		real_x =  11730 + 11730*((x_pos-11730)/4653.0);
	}
	
	else
		real_x = x_pos;
	
	if(y_pos > 11796) {
		real_y = 11796 + 11796*((y_pos-11796)/4587.0);
	}
	
	else
		real_y = y_pos;   
}



void instructions1(void) {

	DrawString(15, 2, "INSTRUCTIONS");
	DrawString(0, 15, "LEFT BUTTON");
	DrawString(0, 25, "PREVIOUS PAGE");

	DrawString(0, 35, "RIGHT BUTTON");
	DrawString(0, 45, "NEXT PAGE");
	DrawString(3, 55, "LEFT FOR INSTRUCTIONS");

	
