klemos06/EFM8LB1-Project/integratedremote.c
	if(right_button_pressed)
    	current_state = STATE_MENU;
   	if(left_button_pressed)
    	current_state = INSTRUCTIONS2;
	
	OLED_Update();
}

void instructions3(void) {

	DrawString(15, 2, "INSTRUCTIONS");
	DrawString(0, 15, "TRIGGERS");
	DrawString(0, 25, "SWING ARM");
	DrawString(0, 35, "RIGHT JS BUTTON");
	DrawString(0, 45, "SELECT");
		
	if(right_button_pressed)
    	current_state = INSTRUCTIONS2;
	
	OLED_Update();	
}


void instructions2(void) {

	DrawString(15, 2, "INSTRUCTIONS");
	DrawString(0, 15, "LEFT JOYSTICK");
	DrawString(0, 25, "MOVE ROBOT");
	DrawString(0, 35, "RIGHT JOYSTICK");
	DrawString(0, 45, "MOVE CURSOR");
	DrawString(3, 55, "LEFT FOR INSTRUCTIONS");
	
	if(right_button_pressed)
    	current_state = INSTRUCTIONS1;
	if(left_button_pressed)
    	current_state = INSTRUCTIONS3;
	
	OLED_Update();	
}



// Menu state functionality
void initialization(void) {
	DrawString(20, 5, "WELCOME");
	DrawString(3, 35, "LEFT FOR INSTRUCTIONS");
	DrawString(3, 55, "RIGHT FOR SELECTION");
	
	vibrate = 1; // Turn off the vibrations
	
	if(right_button_pressed)
    	current_state = STATE_SCREEN1; // Move to other screen
    	
    if(left_button_pressed)
    	current_state = INSTRUCTIONS1; // Move to other screen	
    	
	OLED_Update();
}

// Path selector functionality
void path_selector(void) {

	// Draw strings
	DrawString(10, 10, "PATH SELECTOR");
	DrawString(10, 30, "PATH 1");
    DrawString(50, 30, "PATH 2");
    DrawString(90, 30, "PATH 3");
    
    // Clear lower row
    DrawString(0, 45, "                                       ");
   
    
    if(right_button_pressed) {
    	current_state = STATE_SCREEN2; // Move to other screen
    //	if(path_val ==2)
    		rect_x = 0; // Move rectangle to the left if it is in the middle
    		path_val = 0; // Handles screen switching edge cases
    		mode = 0;
    }
    
    if(left_button_pressed) {
    	current_state = STATE_MENU;
    }
   // If joystick right
   if(real_x_sec==1){
   	rect_x+=40;
   	if (path_val < 3) {
   		path_val++;
   	}
   	waitms(50);
   }
   // If joystick left
   if(real_x_sec==-1){
   	rect_x-=40;
   	if (path_val > 1) {
   		path_val--;
   	}
   	waitms(50);
   }
   
   if(rect_x>128||rect_x+43>128){
   	rect_x=80;
   }
   
   if(rect_x<10){
   	 rect_x=10;
   }
   DrawFilledRect(rect_x,40,rect_x+30,43);
   
   	// Check if right joystick button (select) has been pressed
	if(right_joystick_button==0){
		chosen_path = path_val; // Lock in  a chosen path from the current path value
	}
	
	// Print indicator for chosen path
    if(chosen_path ==1)
    	DrawString(20, 45, "S");
    
    if(chosen_path ==2)
    	DrawString(60, 45, "S");
    
    if(chosen_path ==3)
    	DrawString(100, 45, "S");
   
   OLED_Update();
}

// Mode selector screen functionality
void mode_selector(void) {

	DrawString(10, 10, "MODE SELECTOR");
	DrawString(10, 30, "AUTOMATIC");
	DrawString(80, 30, "MANUAL");
		
	// Clear lower row
    DrawString(0, 45, "                                       ");
   
	
	// DISPLAY THE LINE
	// If joystick right
   if(real_x_sec==1){
   	rect_x+=80;
   	if (mode < 1) {
   		mode++;
   	}
   	waitms(50);
   }
   // If joystick left
   if(real_x_sec==-1){
   	rect_x-=80;
   	if (mode> 0) {
   		mode--;
   	}
   	waitms(50);
   }
   
   if(rect_x>128||rect_x+43>128){
   	rect_x=80;
   }
   
   if(rect_x<10){
   	 rect_x=10;
   }
   DrawFilledRect(rect_x,40,rect_x+40,43);

	// Switch displays when side button pressed
	if(right_button_pressed) {
		current_state = STATE_SCREEN3;
		chosen_confirm = 0;	
	}
	if(left_button_pressed) {
		current_state = STATE_SCREEN1;
		path_val = 1;
		rect_x = 0; // Move cursor to left and fix any edge cases
	}
	
	// Check if right joystick button (select) has been pressed
	if(right_joystick_button==0){
		chosen_mode = mode; // Lock in  a chosen mode from the current mode value
	}
	
	// Print indicator for chosen path
   	if(chosen_mode == 0)// Automatic
    	DrawString(20, 45, "S");
    if(chosen_mode == 1) // Manual
    	DrawString(90, 45, "S");
		
	OLED_Update();
}

// Confirmation screen functionality
void confirmation(void) {

	DrawString(5, 10, "CONFIRM?");
	DrawString(10, 20, "NO");
	DrawString(80, 20, "YES");
	DrawString(2, 50, "-PRESS BOTH JS-");
	
	// Check if right joystick button (select) has been pressed
	if(right_joystick_button==0 && left_joystick_button ==0 && confirm == 1){
		if (chosen_path ==4 || chosen_mode ==4)
			DrawString(5, 32, "SELECT ALL OPTIONS");
		else
			chosen_confirm = confirm; // Lock in  a chosen mode from the current mode value
	}
		
  
   	// Print indicator for chosen path
   	if(chosen_confirm == 1)// Yes
    	current_state = STATS;
    //if(chosen_confirm == 1) // No
 
   
	
	// DISPLAY THE LINE
	// If joystick right
   if(real_x_sec==1){
   	rect_x+=80;
   	if (confirm < 1) {
   		confirm++;
   	}
   	waitms(50);
   }
   // If joystick left
   if(real_x_sec==-1){
   	rect_x-=80;
   	if (confirm> 0) {
   		confirm--;
   	}
   	waitms(50);
   }
   
   if(rect_x>128||rect_x+43>128){
   	rect_x=80;
   }
   
   if(rect_x<10){
   	 rect_x=10;
   }
   DrawFilledRect(rect_x,40,rect_x+40,43);

	if(left_button_pressed) {
		current_state = STATE_SCREEN2;
		rect_x = 10;
		mode = 0;
	}
		
	OLED_Update();

}

// Display robot information and enable data sending if automatic mode
void stats(void) {

	DrawString(0, 10, "STATISTICS");
	
	vibrate = 0;

	// this stuff works more - no more conversion to 8 bits 
	while(chosen_mode == 0) {
		// ----- BEGIN IR STUFF WHEN EVERYTHING IS SELECTED
	
		//read_inputs(); // Read inputs
		
			// Emergency exit to home
		if(right_button_pressed) {
			current_state = STATE_MENU;
		}
		
		read_inputs();
		
		// map 14 to 8 bits
		eight_bitx = fourteen_to_eight(real_x);
		eight_bity = fourteen_to_eight(real_y);

		start_transmit(1);
		transmit_byte(eight_bitx);
		transmit_byte(eight_bity);
		transmit_bit(trigl);
		transmit_bit(trigr);
		transmit_bit(left_joystick_button);
		transmit_path(chosen_path);
		transmit_checksum(eight_bitx,eight_bity);
		end_transmit(1);
		
		// final pulse - will be thick on oscope
		ir_send =1;
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);				
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);
		Timer3us(560);
		ir_send = 0; 
		
