klemos06/EFM8LB1-Project/integratedremote.c
		waitms(100); 
		
	//	printf("hey, baby");
	}
	// original package --> 11100xxxxxxxxyyyyyyyy10000 (26 bits)
	// current package --> 11100xxxxxxxxyyyyyyyybbbppcccccccc10000 
	
		
//	printf("x_pos: %d, y_pos: %d, button: %d\n", real_x, real_y, button);
	
		
	// ints are 16 bits

//	float_to_stringprinty(2, y_pos);

	OLED_Update();

}



//----- MAIN -----
void main (void) 
{
	//Init_MCU(); // DO WE STILL NEED THIS?
	OLED_Init(); // Initialize the OLED display
    OLED_ClearDisplay(); // Clear the OLED
	TIMER0_Init(); // Initialize timer 0
	InitADC(); // Initialize the ADC
	InitPinADC(2,2); // Initialize pin 2.2 as analog
	InitPinADC(2,3); // Initialize pin 2.3 as analog
	InitPinADC(2,6); // Initialize pin 2.6 as analog

	// Initialize everything
	prev_butl = 1; // Set previous button press to zero to help with debouncing
	prev_butr = 1; 
	
	path_val = 1; // Set path to 0 initially
	chosen_path = 4;
	mode = 0; // Set mode initially to zero
	chosen_mode = 4; // Set random mode so no s appears on display screen initially
	
	chosen_confirm = 4; // Set random mode so it doesn't auto select
	confirm = 0;
	
	current_state = STATE_MENU; // set current state

	while(1) {
	//	MAIN_OUT=!MAIN_OUT;
		//button = left_joystick_button;
		//int_to_stringprint(1, button);
		
		read_inputs(); // Read all inputs	
		
		// FSM Case Statements
		switch(current_state) {
    	
    		case INSTRUCTIONS1:
    			instructions1();
    			break;
    		case INSTRUCTIONS2:
    			instructions2();
    			break;
    		case INSTRUCTIONS3:
    			instructions3();
    			break;
    	
	    	// Home screen
	    	case STATE_MENU:
	    		initialization();
	    		break;
	    	
	    	// Screen 2
	    	case STATE_SCREEN1:
	    		path_selector();
	    		break;
	    	
	    	// Screen 3
	    	case STATE_SCREEN2:
	    		mode_selector();
	    		break;		
	    	
	    	case STATE_SCREEN3:
	    		confirmation();
	    		break;
	    			
	    	case STATS:
	    		stats();
	    		break;
	    }
	}
}
